[
  {
    "id": "1",
    "slug": "h2h-music-core-comeback-stage",
    "title": "H2H Stuns with FOCUS Comeback Stage at Music Core!",
    "titleKo": "H2H, 뮤직코어 컴백 무대에서 FOCUS로 열광 선사!",
    "category": "latest-news",
    "excerpt": "Hearts2Hearts delivered a breathtaking performance of their latest title track 'FOCUS' on MBC Music Core, showcasing ethereal pink ballet-inspired outfits and powerful choreography.",
    "content": "<p>Hearts2Hearts (H2H) made a stunning comeback appearance on MBC Music Core on October 25th, 2025, performing their highly anticipated title track \"FOCUS\" from their latest album.</p>\n\n<h2>A Performance to Remember</h2>\n<p>The girls took the stage in elegant pink ballet-inspired outfits, perfectly complementing the dreamy, cathedral-themed concept of the song. The performance featured intricate choreography that highlighted each member's individual strengths while maintaining the group's signature synchronized style.</p>\n\n<h2>Fan Reactions</h2>\n<p>The performance quickly went viral on social media, with Carmen's ending fairy moment garnering over 376+ likes on X (Twitter) within hours. Fans praised the group's stage presence and the stunning visual production.</p>\n\n<blockquote>\"The girls absolutely killed it! Carmen's ending fairy gave me chills!\" - @S2U_Forever</blockquote>\n\n<h2>What's Next</h2>\n<p>H2H will continue promotions throughout the month with appearances on various music shows and variety programs. Stay tuned for more exciting content from our 8 talented angels!</p>",
    "coverImage": "https://pbs.twimg.com/media/G4KZGz4WIAAqjFe?format=jpg&name=large",
    "images": [
      "https://pbs.twimg.com/media/GuM79fna4AAheyd?format=jpg&name=4096x4096",
      "https://pbs.twimg.com/media/G3eCEQ5XMAAegeW?format=jpg&name=4096x4096"
    ],
    "author": {
      "name": "H2H Official",
      "role": "SM Entertainment",
      "avatar": "/images/h2h_logo.png"
    },
    "tags": ["FOCUS", "Comeback", "Music Core", "Performance"],
    "publishedAt": "2025-10-25T10:00:00Z",
    "featured": true,
    "views": 15420,
    "likes": 892,
    "readTime": 3,
    "status": "published",
    "createdAt": "2025-10-24T15:00:00Z",
    "updatedAt": "2025-10-25T10:00:00Z"
  },
  {
    "id": "2",
    "slug": "behind-scenes-focus-mv-shooting",
    "title": "Behind the Scenes: Making of FOCUS Music Video",
    "titleKo": "비하인드 스토리: FOCUS 뮤직비디오 촬영 현장",
    "category": "behind-the-scenes",
    "excerpt": "Go behind the scenes of H2H's 'FOCUS' MV filming! From the stunning flower cathedral set to the members' individual filming experiences, discover what went into creating this visual masterpiece.",
    "content": "<p>The making of H2H's \"FOCUS\" music video was an incredible journey that took three full days of filming in various locations around Seoul.</p>\n\n<h2>The Flower Cathedral Concept</h2>\n<p>The iconic flower cathedral scene was filmed in a specially constructed set that took over a week to build. The production team used over 10,000 fresh flowers to create the dreamy, ethereal atmosphere.</p>\n\n<h2>Member Reactions</h2>\n<p><strong>Jiwoo:</strong> \"When I first saw the set, I was overwhelmed. It was like stepping into a fairy tale!\"</p>\n<p><strong>Carmen:</strong> \"The most challenging part was keeping a straight face during the emotional scenes. The set was so beautiful it made me emotional for real!\"</p>\n<p><strong>Yuha:</strong> \"I loved the solo shots in the rose garden. It felt very princess-like!\"</p>\n\n<h2>Fun Facts</h2>\n<ul>\n  <li>The MV took 72 hours of continuous filming</li>\n  <li>Over 30 staff members worked on set design</li>\n  <li>The girls went through 15 different outfit changes</li>\n  <li>Stella choreographed some of the individual dance breaks</li>\n</ul>",
    "coverImage": "https://pbs.twimg.com/media/G3eCEQ5XMAAegeW?format=jpg&name=4096x4096",
    "images": [
      "https://pbs.twimg.com/media/G3qWYx3WoAAnhAm?format=jpg&name=large",
      "https://pbs.twimg.com/media/G3Gm90Nb0AANTN2?format=jpg&name=large"
    ],
    "author": {
      "name": "Production Team",
      "role": "SM Entertainment"
    },
    "tags": ["Behind-the-Scenes", "FOCUS", "Music Video", "Production"],
    "publishedAt": "2025-10-23T14:30:00Z",
    "featured": true,
    "views": 12340,
    "likes": 756,
    "readTime": 5,
    "status": "published",
    "createdAt": "2025-10-22T09:00:00Z",
    "updatedAt": "2025-10-23T14:30:00Z"
  },
  {
    "id": "3",
    "slug": "fan-story-first-h2h-concert-experience",
    "title": "A Fan's Journey: My First H2H Concert Experience",
    "titleKo": "팬 스토리: 첫 H2H 콘서트 경험",
    "category": "fan-stories",
    "excerpt": "A heartfelt story from a dedicated S2U about attending their first H2H concert and the unforgettable memories made that night.",
    "content": "<p>Written by: Sarah Kim (@sarah_s2u)</p>\n\n<h2>The Wait Was Worth It</h2>\n<p>I've been a fan of H2H since their debut with \"The Chase,\" but I never imagined I'd get to see them live. When tickets went on sale for their Seoul showcase, I camped out online for hours. And when I finally got my ticket? I cried tears of joy!</p>\n\n<h2>The Night of the Concert</h2>\n<p>Walking into the venue, I was surrounded by fellow S2Us holding their lightsticks (well, we don't have official ones yet, but we made our own!). The energy was electric.</p>\n\n<p>When the girls came on stage performing \"Style,\" I felt like my heart would explode. Seeing them in person, their talent, their smiles, their interaction with fans - it was everything I dreamed of and more.</p>\n\n<h2>My Bias Noticed Me!</h2>\n<p>During the fan interaction segment, Ian (my bias!) pointed at my homemade sign that said \"Ian, you make my days brighter! 🌟\" and she gave me the biggest smile and a heart. I'm still not over it!</p>\n\n<h2>Final Thoughts</h2>\n<p>To anyone hesitating about going to an H2H event - DO IT! The experience is indescribable. The connection you feel with the members and other fans is something special. I'm already saving up for their next tour!</p>\n\n<p><em>Want to share your H2H story? Submit it through our contact page!</em></p>",
    "coverImage": "https://jigeum.media/wp-content/uploads/2025/07/GumH0RrW8AAyzec-e1753420976792.jpg",
    "author": {
      "name": "Sarah Kim",
      "role": "S2U Fan"
    },
    "tags": ["Fan Story", "Concert", "Experience", "Ian"],
    "publishedAt": "2025-10-22T09:15:00Z",
    "featured": false,
    "views": 8920,
    "likes": 634,
    "readTime": 4,
    "status": "published",
    "createdAt": "2025-10-21T14:00:00Z",
    "updatedAt": "2025-10-22T09:15:00Z"
  },
  {
    "id": "4",
    "slug": "carmen-interview-vocal-journey",
    "title": "In Conversation: Carmen Opens Up About Her Vocal Journey",
    "titleKo": "인터뷰: 카르멘이 밝히는 보컬 여정",
    "category": "interviews",
    "excerpt": "Main vocalist Carmen sits down for an exclusive interview about her musical background, training days, and what it takes to be H2H's main vocal.",
    "content": "<p><em>This interview was conducted on October 20th, 2025</em></p>\n\n<h2>Early Beginnings</h2>\n<p><strong>Q: When did you first discover your love for singing?</strong></p>\n<p><strong>Carmen:</strong> \"I was about 7 years old when I joined my school choir. My teacher told my parents I had a special voice, and from that moment, I knew singing was what I wanted to do forever.\"</p>\n\n<h2>Training Period</h2>\n<p><strong>Q: What was the most challenging part of your training?</strong></p>\n<p><strong>Carmen:</strong> \"Definitely the vocal training sessions. We'd practice for hours every day, working on technique, range, and stamina. There were days my voice would be so tired, but you have to push through and trust the process.\"</p>\n\n<h2>Being Main Vocal</h2>\n<p><strong>Q: How do you handle the pressure of being the main vocal?</strong></p>\n<p><strong>Carmen:</strong> \"I feel a big responsibility, but I'm not alone. All our members are incredibly talented vocalists. We support each other. When one of us is struggling, the others lift them up. That's what makes H2H special.\"</p>\n\n<h2>Musical Influences</h2>\n<p><strong>Q: Who are your vocal inspirations?</strong></p>\n<p><strong>Carmen:</strong> \"I really admire Taeyeon sunbaenim from Girls' Generation. Her emotional delivery and technical skill are goals I'm constantly working towards. Also, Ariana Grande - her runs and agility are insane!\"</p>\n\n<h2>Message to S2U</h2>\n<p><strong>Q: Any message for fans?</strong></p>\n<p><strong>Carmen:</strong> \"Thank you for always supporting us and cheering us on. Your love gives me strength to keep improving. I promise to work hard and show you even better performances. Love you all! 💕\"</p>",
    "coverImage": "https://pbs.twimg.com/media/G2ZpJ76b0AAVEvj?format=jpg&name=4096x4096",
    "author": {
      "name": "Music Weekly",
      "role": "Interview Team"
    },
    "tags": ["Interview", "Carmen", "Main Vocal", "Behind-the-Scenes"],
    "publishedAt": "2025-10-20T16:00:00Z",
    "featured": true,
    "views": 11250,
    "likes": 823,
    "readTime": 6,
    "status": "published",
    "createdAt": "2025-10-19T10:00:00Z",
    "updatedAt": "2025-10-20T16:00:00Z"
  },
  {
    "id": "5",
    "slug": "h2h-dance-practice-focus-released",
    "title": "FOCUS Dance Practice Video Hits 1M Views in 24 Hours!",
    "titleKo": "FOCUS 안무 연습 영상, 24시간 만에 100만 조회수 돌파!",
    "category": "performances",
    "excerpt": "H2H's 'FOCUS' dance practice video has taken the internet by storm, showcasing the group's incredible synchronization and powerful choreography.",
    "content": "<p>The official dance practice video for H2H's title track \"FOCUS\" has achieved a remarkable milestone, surpassing 1 million views within just 24 hours of release.</p>\n\n<h2>Breaking Down the Choreography</h2>\n<p>The \"FOCUS\" choreography is a perfect blend of powerful moves and elegant formations. Choreographed by SM's renowned dance team with input from member Stella, the routine features:</p>\n\n<ul>\n  <li><strong>The Focus Point:</strong> The signature move where all members point to the center</li>\n  <li><strong>The Cascade:</strong> A mesmerizing wave formation that flows through the group</li>\n  <li><strong>The Mirror:</strong> Intricate partner work showcasing the members' chemistry</li>\n  <li><strong>The Cathedral:</strong> A formation representing the MV's flower cathedral</li>\n</ul>\n\n<h2>Fan Reactions</h2>\n<p>Dance covers have already started flooding social media, with fans from around the world attempting to master the challenging choreography.</p>\n\n<blockquote>\"The synchronization is INSANE! You can tell they practiced this for hours!\" - @DanceLife_KPop</blockquote>\n\n<h2>Member Comments</h2>\n<p><strong>A-na (Lead Dancer):</strong> \"This choreography pushed us all to our limits, but we're so proud of the result. The energy and story we wanted to tell really comes through in the dance.\"</p>",
    "coverImage": "https://pbs.twimg.com/media/G3TpdgjbgAAObnB?format=jpg&name=4096x4096",
    "author": {
      "name": "H2H Official",
      "role": "SM Entertainment"
    },
    "tags": ["FOCUS", "Dance Practice", "Choreography", "Milestone"],
    "publishedAt": "2025-10-21T11:00:00Z",
    "featured": false,
    "views": 9870,
    "likes": 678,
    "readTime": 3,
    "status": "published",
    "createdAt": "2025-10-20T16:00:00Z",
    "updatedAt": "2025-10-21T11:00:00Z"
  },
  {
    "id": "6",
    "slug": "h2h-mama-awards-nomination",
    "title": "H2H Nominated for Best New Artist at 2025 MAMA Awards!",
    "titleKo": "H2H, 2025 MAMA 어워드 신인상 후보 지명!",
    "category": "announcements",
    "excerpt": "Hearts2Hearts has been officially nominated for Best New Artist at the prestigious 2025 MAMA Awards! Voting is now open for S2U to support their favorite group.",
    "content": "<p>We are thrilled to announce that Hearts2Hearts (H2H) has been nominated for the Best New Artist award at the 2025 Mnet Asian Music Awards (MAMA)!</p>\n\n<h2>About the Nomination</h2>\n<p>This nomination recognizes H2H's incredible debut year, which included:</p>\n<ul>\n  <li>Successful debut with \"The Chase\"</li>\n  <li>Follow-up hits \"Style\" and \"Pretty Please\"</li>\n  <li>Latest comeback with \"FOCUS\"</li>\n  <li>Multiple music show wins</li>\n  <li>Growing international fanbase</li>\n</ul>\n\n<h2>How to Vote</h2>\n<p>S2U, your votes matter! Here's how you can support H2H:</p>\n<ol>\n  <li>Visit the official MAMA voting website</li>\n  <li>Sign in or create an account</li>\n  <li>Navigate to \"Best New Artist\" category</li>\n  <li>Vote for Hearts2Hearts</li>\n  <li>Share with fellow S2Us!</li>\n</ol>\n\n<p><strong>Voting Period:</strong> October 15 - October 30, 2025</p>\n\n<h2>Members' Reactions</h2>\n<p><strong>Jiwoo (Leader):</strong> \"We're so grateful and honored to be nominated alongside such amazing artists. This is all thanks to S2U's love and support!\"</p>\n\n<p><strong>Ye-on (Maknae):</strong> \"I couldn't believe it when we heard the news! Please vote for us, S2U! We'll work even harder! 💕\"</p>\n\n<h2>Vote Now!</h2>\n<p>Let's show the world the power of S2U! Every vote counts in bringing this award home for H2H!</p>\n\n<p><a href=\"https://mama.vote\" target=\"_blank\">🗳️ VOTE NOW FOR H2H</a></p>",
    "coverImage": "https://pbs.twimg.com/media/G2QFkMFbwAEq-kh?format=jpg&name=4096x4096",
    "author": {
      "name": "H2H Official",
      "role": "SM Entertainment"
    },
    "tags": ["MAMA", "Awards", "Voting", "Best New Artist"],
    "publishedAt": "2025-10-15T08:00:00Z",
    "featured": true,
    "views": 18560,
    "likes": 1245,
    "readTime": 4,
    "status": "published",
    "createdAt": "2025-10-14T14:00:00Z",
    "updatedAt": "2025-10-15T08:00:00Z"
  },
  {
    "id": "7",
    "slug": "jiwoo-leadership-journey",
    "title": "Jiwoo's Leadership: From Trainee to H2H's Captain",
    "titleKo": "지우의 리더십: 연습생에서 H2H 리더까지",
    "category": "interviews",
    "excerpt": "Leader Jiwoo shares her journey of becoming H2H's captain and what it means to guide seven talented members through their career.",
    "content": "<p><em>Exclusive interview with H2H Leader Jiwoo</em></p>\n\n<h2>Chosen as Leader</h2>\n<p><strong>Q: How did you feel when you were chosen as leader?</strong></p>\n<p><strong>Jiwoo:</strong> \"Honestly, I was scared! Leading seven incredibly talented girls is a huge responsibility. But I knew that as the oldest and with my training experience, I could guide us well.\"</p>\n\n<h2>Leadership Style</h2>\n<p><strong>Q: How would you describe your leadership approach?</strong></p>\n<p><strong>Jiwoo:</strong> \"I try to lead by example rather than just giving orders. I want our members to feel comfortable coming to me with anything - whether it's about work or personal struggles. We're a family.\"</p>\n\n<h2>Challenges</h2>\n<p><strong>Q: What's the hardest part about being a leader?</strong></p>\n<p><strong>Jiwoo:</strong> \"Balancing everyone's needs and personalities. We're eight different people with different strengths and struggles. Making sure everyone feels heard and valued while keeping the group unified - that's the real challenge.\"</p>\n\n<h2>Proud Moments</h2>\n<p><strong>Q: What's your proudest moment as a leader?</strong></p>\n<p><strong>Jiwoo:</strong> \"Our first win. Seeing all the members crying tears of joy, knowing all our hard work paid off - that moment made everything worth it. I felt like I had done my job as their leader.\"</p>\n\n<h2>Future Goals</h2>\n<p><strong>Q: What are your goals for H2H?</strong></p>\n<p><strong>Jiwoo:</strong> \"I want us to be a group that lasts for decades, like our sunbaenims SNSD. A group where each member can shine individually while our bond remains strong. That's my dream as a leader.\"</p>",
    "coverImage": "https://pbs.twimg.com/media/G3yu1btXEAEc61x?format=jpg&name=large",
    "author": {
      "name": "K-Pop Herald",
      "role": "Senior Reporter"
    },
    "tags": ["Interview", "Jiwoo", "Leadership", "Behind-the-Scenes"],
    "publishedAt": "2025-10-18T13:00:00Z",
    "featured": false,
    "views": 7650,
    "likes": 592,
    "readTime": 5,
    "status": "published",
    "createdAt": "2025-10-17T10:00:00Z",
    "updatedAt": "2025-10-18T13:00:00Z"
  },
  {
    "id": "8",
    "slug": "stella-producing-credits-focus",
    "title": "Stella Receives Producing Credits on FOCUS Album",
    "titleKo": "스텔라, FOCUS 앨범에서 프로듀싱 크레딧 획득",
    "category": "latest-news",
    "excerpt": "All-rounder Stella has been credited as a co-producer on two tracks from H2H's latest album, showcasing her musical versatility.",
    "content": "<p>H2H's Stella continues to prove why she's called the group's all-rounder, earning production credits on the latest FOCUS album.</p>\n\n<h2>The Tracks</h2>\n<p>Stella received credits on:</p>\n<ul>\n  <li><strong>\"Midnight Whispers\"</strong> - Co-composed and arranged the instrumental bridge</li>\n  <li><strong>\"Our Story\"</strong> - Wrote lyrics and helped with melody composition</li>\n</ul>\n\n<h2>Behind the Production</h2>\n<p>According to the album's main producer, Stella spent countless hours in the studio, bringing fresh ideas and a unique perspective to the tracks.</p>\n\n<blockquote>\"Stella has an incredible ear for melody and arrangement. She's a natural producer.\" - Lee Soo-man, Executive Producer</blockquote>\n\n<h2>Stella's Comments</h2>\n<p>\"I've always wanted to be more involved in our music production. Being able to contribute to our album is a dream come true. I hope S2U can feel the love and effort I put into these songs!\"</p>\n\n<h2>Fan Reception</h2>\n<p>Fans have been overwhelmingly supportive, trending #ProducerStella worldwide on Twitter and praising her musical talents.</p>\n\n<h2>What's Next?</h2>\n<p>Stella has hinted at working on more production projects in the future, potentially even producing an entire track for H2H's next album!</p>",
    "coverImage": "https://www.nme.com/wp-content/uploads/2025/02/hearts2hearts-sm-entertainment-new-girl-group-debut-the-chase-single.jpg",
    "author": {
      "name": "Music Production Weekly",
      "role": "Editorial Team"
    },
    "tags": ["Stella", "Producer", "FOCUS", "Behind-the-Scenes"],
    "publishedAt": "2025-10-19T10:30:00Z",
    "featured": false,
    "views": 6780,
    "likes": 487,
    "readTime": 3,
    "status": "published",
    "createdAt": "2025-10-18T15:00:00Z",
    "updatedAt": "2025-10-19T10:30:00Z"
  }
]